type County = 
// 서울
'강남' | '강동' | '강북' | '강서(서울)' | '관악' | '광진' | '구로' | '금천' | '노원' | '도봉' | '동대문' | '동작' | '마포' | '서대문' | '서초' | '성동' | '성북' | '송파' |
'양천' | '영등포' | '용산' | '은평' | '종로' | '중구(서울)' | '중랑' |
// 경기
'가평' | '고양' | '과천' | '광명' | '광주' | '구리' | '군포' | '김포' | '남양주' | '동두천' | '부천' | '성남' | '수원' | '시흥' | '안산' | '안성' | '안양' | '양주' | '양평' |
'연천' | '오산' | '용인' | '의왕' | '의정부' | '이천' | '파주' | '평택' | '포천' | '하남' | '화성' |
// 인천
'강화' | '계양' | '남동' | '동구(인천)' | '미추홀' | '부평' | '서구(인천)' | '연수' | '옹진' | '중구(인천)' |
// 강원
'강릉' | '고성(강원)' | '동해' | '삼척' | '속초' | '양구' | '양양' | '영월' | '원주' | '인제' | '정선' | '철원' | '춘천' | '태백' | '평창' | '홍천' | '화천' | '횡성' |
// 충남
'계룡' | '공주' | '금산' | '논산' | '당진' | '보령' | '부여' | '서산' | '서천' | '아산' | '천안' | '청양' | '태안' | '홍성' |
// 세종
'세종' |
// 대전
'대덕' | '동구(대전)' | '서구(대전)' | '유성' | '중구(대전)' |
// 충북
'괴산' | '단양' | '보은' | '영동' | '예산' | '옥천' | '음성' | '제천' | '증평' | '진천' | '청주' | '충주' |
// 대구
'군위' | '남구(대구)' | '달서' | '달성' | '동구(대구)' | '북구(대구)' | '서구(대구)' | '수성' | '중구(대구)' |
// 경북
'경산' | '경주' | '고령' | '구미' | '김천' | '문경' | '봉화' | '상주' | '성주' | '안동' | '영덕' | '영양' | '영주' | '영천' | '예천' | '울릉' | '울진' | '의성' | '청도' | 
'청송' | '칠곡' | '포항' |
// 전북
'고창' | '군산' | '김제' | '무주' | '부안' | '순창' | '완주' | '익산' | '임실' | '장수' | '전주' | '정읍' | '진안' |
// 광주
'광산' | '남구(광주)' | '동구(광주)' | '북구(광주)' | '서구(광주)' |
// 전남
'강진' | '고흥' | '곡성' | '광양' | '구례' | '나주' | '남원' | '담양' | '목포' | '무안' | '보성' | '순천' | '신안' | '여수' | '영광' | '영암' | '완도' | '장성' | '장흥' |
'진도' | '함평' | '해남' | '화순' |
// 부산
'강서(부산)' | '금정' | '기장' | '남구(부산)' | '동구(부산)' | '동래' | '부산진' | '북구(부산)' | '사상' | '사하' | '서구(부산)' | '수영' | '연제' | '영도' | '중구(부산)' |
'해운대' | 
// 울산
'남구(울산)' | '동구(울산)' | '북구(울산)' |  '울주' | '중구(울산)' |
// 경남
'거제' | '거창' | '고성(경남)' | '김해' | '남해' | '밀양' | '사천' | '산청' | '양산' | '의령' | '진주' | '창녕' | '창원' | '통영' | '하동' | '함안' | '함양' | '합천' |
// 제주
'제주' | '서귀포';
export default County;